In [5]:
import sqlalchemy
import numpy as np
import pandas as pd
import sklearn
import sqlite3
import dask

In [6]:
conn = sqlite3.connect("CompanyEmployeeDB.db")
type(conn)

sqlite3.Connection

In [7]:
# cursor object
cur = conn.cursor()

In [8]:
cur.execute("""
CREATE TABLE Company(
company_id INT PRIMARY KEY, company_name ChAR(40),
value CHAR(10), location CHAR(10), type CHAR(10));
""")

In [9]:
cur.execute("""
CREATE TABLE Employee(
emp_id INT PRIMARY KEY, emp_name CHAR(40),
age INT, city CHAR(10), salary INT);
""")

In [10]:
result = cur.execute("SELECT name FROM sqlite_master")
result.fetchone()

('Company',)

In [11]:
data = [
    (101,'ABC','25M','India','IT '),
    (102,'XYZ','20M','Australia','Software'),
    (103,'PQR','30M','Sweden','Consulting'),
    (104,'LMN','10M','Canada','Finance'),
]
cur.executemany("INSERT INTO Company VALUES(?,?,?,?,?)",data)

In [12]:
data = [
    (1001,'Sam',25,'Hyderabad',50000),
    (1002,'Peter',26,'Perth',100000),
    (1003,'Qwery',24,'Bangalore',60000),
    (1004,'Walt',21,'Ottawa',700000),
]
cur.executemany("INSERT INTO Employee VALUES(?,?,?,?,?)",data)

In [13]:
conn.commit()

In [14]:
res = cur.execute("SELECT company_name FROM Company")
res.fetchall()

[('ABC',), ('XYZ',), ('PQR',), ('LMN',)]

In [16]:
for row in cur.execute("SELECT age, salary from Employee WHERE salary > 50000 ORDER by age"):
    print(row)

(21, 700000)
(24, 60000)
(26, 100000)